Tekla Open API Reference for Tekla Structures 2025
Arc.Equals Method (Object)
 Checks for equality with another arc
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override bool Equals(
	Object other
)
Public Overrides Function Equals (
	other As Object
) As Boolean
Parameters
other
Type: System.Object
Other arc
Return Value
Type: Boolean
True if equal, false otherwise
See Also
Reference
Arc Class
Equals Overload
Tekla.Structures.Geometry3d Namespace